## Limpieza de texto

En este primer script vamos a tratar la  **limpieza de texto**, el dataset es un ejemplo de datos p√∫blicos generados, guardados y publicados por organismos de gobierno de Argentina del siguiente link: https://datos.gob.ar/dataset 
El dataset con el que se trabaja se encuentra en mi drive para descargar en el siguiente link: https://drive.google.com/file/d/1gvMy2oM9rJ06dkiYy6snY3alsP0L5s8b/view?usp=sharing

In [1]:
import pandas as pd
from funpymodeling import freq_tbl,status,profiling_num
import string
import re
import warnings
warnings.filterwarnings("ignore", category=DeprecationWarning)

He trabajado datos de reniec y de migraciones de mi Pa√≠s donde tengo informaci√≥n de apellidos, nombres, fecha de nacimiento y de movimiento migratorio, he tenido que trabajar con estos campos para su comparaci√≥n, dado que los datos de estos dataset tienen signos de puntuaci√≥n, alfanum√©ricos, ac√©ntos, n√∫meros, etc.

In [3]:
%%time
ruta = r"C:\Users\Computer\Documents\5.ML\NLP\Bases\personas.csv"
personas=pd.read_csv(ruta, sep=";", encoding="latin1", error_bad_lines=False,index_col=False)
print(personas.shape)
personas.head()

<timed exec>:2: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version. Use on_bad_lines in the future.


<timed exec>:2: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.

(207515, 6)
Wall time: 224 ms

  persona_id           nombre  apellido  sexo_id  edad cvar_ultimo_acceso
0          1       JUAN PABLO      soto      2.0  46.0         29/11/2017
1          2          SILVINA  GONZALEZ      1.0  38.0          6/02/2012
2          3   DIEGO FERNANDO   ASENSIO      2.0  48.0         28/11/2019
3          4  MAR√É¬çA VICTORIA   TIGNINO      1.0  39.0         24/04/2019
4          5     CLAUDIA LEDA    MATTEO      1.0  58.0          2/09/2018

In [4]:
status(personas)

             variable  q_nan     p_nan  q_zeros  p_zeros  unique     type
0          persona_id      0  0.000000        0      0.0  207515   object
1              nombre   2183  0.010520        0      0.0   64231   object
2            apellido   3312  0.015960        0      0.0   84267   object
3             sexo_id  54441  0.262347        0      0.0       2  float64
4                edad  54441  0.262347        0      0.0      83  float64
5  cvar_ultimo_acceso  54614  0.263181        0      0.0    3220   object

Observando los campos Sexo y edad son num√©ricos, entonces lo cambiamos a integer para no tenerlo como float

In [7]:
personas['sexo_id'] = personas['sexo_id'].astype('Int64')
personas['edad'] = personas['edad'].astype('Int64')
status(personas)

             variable  q_nan     p_nan  q_zeros  p_zeros  unique    type
0          persona_id      0  0.000000        0      0.0  207515  object
1              nombre   2183  0.010520        0      0.0   64231  object
2            apellido   3312  0.015960        0      0.0   84267  object
3             sexo_id  54441  0.262347        0      0.0       2   Int64
4                edad  54441  0.262347        0      0.0      83   Int64
5  cvar_ultimo_acceso  54614  0.263181        0      0.0    3220  object

Concatenamos los campos de texto que son nombre y apellido

In [9]:
personas['NombreCompleto'] = personas[['nombre', 'apellido']].apply(lambda x: ' '.join(map(str, x)), axis = 1)
print(personas.shape)
personas.head()

(207515, 7)

,persona_id,nombre,apellido,sexo_id,edad,cvar_ultimo_acceso,NombreCompleto
0,1,JUAN PABLO,soto,2,46,29/11/2017,JUAN PABLO soto
1,2,SILVINA,GONZALEZ,1,38,6/02/2012,SILVINA GONZALEZ
2,3,DIEGO FERNANDO,ASENSIO,2,48,28/11/2019,DIEGO FERNANDO ASENSIO
3,4,MAR√É¬çA VICTORIA,TIGNINO,1,39,24/04/2019,MAR√É¬çA VICTORIA TIGNINO
4,5,CLAUDIA LEDA,MATTEO,1,58,2/09/2018,CLAUDIA LEDA MATTEO

Empezamos la limpieza del campo **NombreCompleto**

* Retirar espacios en blanco de inicio y fin.
* Convertir a may√∫scula.
* Reemplazar caracteres (√Ä, √Å, ,√É,√Ñ,√Ö, √à,√â,√ä,√ã,√å,√ç,√é,√è,√í,√ì,√î,√ï,√ñ,√ò,√ô,√ö,√õ,√ú) por vocales.
* Remover signos de puntuaci√≥n.

In [11]:
personas['NombreCompleto']=personas['NombreCompleto'].str.strip()

In [12]:
personas['NombreCompleto'] = personas['NombreCompleto'].str.upper()
personas.head()

,persona_id,nombre,apellido,sexo_id,edad,cvar_ultimo_acceso,NombreCompleto
0,1,JUAN PABLO,soto,2,46,29/11/2017,JUAN PABLO SOTO
1,2,SILVINA,GONZALEZ,1,38,6/02/2012,SILVINA GONZALEZ
2,3,DIEGO FERNANDO,ASENSIO,2,48,28/11/2019,DIEGO FERNANDO ASENSIO
3,4,MAR√É¬çA VICTORIA,TIGNINO,1,39,24/04/2019,MAR√É¬çA VICTORIA TIGNINO
4,5,CLAUDIA LEDA,MATTEO,1,58,2/09/2018,CLAUDIA LEDA MATTEO

In [13]:
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√Ä','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√Å','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√Ç','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√Ñ','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√Ö','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√É','A')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√à','E')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√â','E')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ä','E')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ã','E')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√å','I')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ç','I')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√é','I')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√è','I')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√í','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ì','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√î','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ï','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ñ','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ò','O')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ô','U')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ö','U')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√õ','U')
personas['NombreCompleto'] = personas['NombreCompleto'].str.replace('√ú','U')

In [14]:
personas['NombreCompleto'] = personas['NombreCompleto'].apply(lambda elem: re.sub("[^0-9A-Za-z ]", "", elem))
personas.head()

,persona_id,nombre,apellido,sexo_id,edad,cvar_ultimo_acceso,NombreCompleto
0,1,JUAN PABLO,soto,2,46,29/11/2017,JUAN PABLO SOTO
1,2,SILVINA,GONZALEZ,1,38,6/02/2012,SILVINA GONZALEZ
2,3,DIEGO FERNANDO,ASENSIO,2,48,28/11/2019,DIEGO FERNANDO ASENSIO
3,4,MAR√É¬çA VICTORIA,TIGNINO,1,39,24/04/2019,MARAA VICTORIA TIGNINO
4,5,CLAUDIA LEDA,MATTEO,1,58,2/09/2018,CLAUDIA LEDA MATTEO

Limpieza para emoticones, s√≠mbolos, pictograf√≠as, en el caso tengas casos de texto de webs

In [15]:
print(u"\U0001F600-\U0001F64F")

üòÄ-üôè

In [16]:
print(u"\U0001F680-\U0001F6FF")

üöÄ-üõø

In [17]:
print(u"\U0001F1E0-\U0001F1FF")

üá†-üáø

In [18]:
print(u"\U00002702-\U000027B0")

‚úÇ-‚û∞

In [19]:
print(u"\U000024C2-\U0001F251")

‚ìÇ-üâë

remueve menciones con **@**, **URLS** y **hashtags**

In [ ]:
document = re.sub("@[A-Za-z0-9_]+"," ", document)
document = re.sub(r'http\S+', ' ', document)
document = re.sub("#[A-Za-z0-9_]+","", document)